cl = [
    # {
    #     'name': 'nameA',
    #     'teacher': 'teacherA',
    #     'day': [1, 3],    # 周一,周三
    #     'time': [1, 2],   # 第一节课-第二节课
    #     'room': 'roomA',
    #     'week': [2, 3, 4, 5, 6, 7, 8, 9, 10]  # 2-10周
    # },
    {
        'name': '工程伦理通论（2班）',
        'teacher': '姜卉',
        'day': [6],
        'time': [2,3,4], 
        'room': '雁栖湖东区礼堂',
        'week': [6]
    },
    {
        'name': '工程伦理通论（2班）',
        'teacher': '姜卉',
        'day': [7],
        'time': [2,3,4], 
        'room': '雁栖湖东区礼堂',
        'week': [3,6]
    },
    {
        'name': '工程伦理-生物（2班）',
        'teacher': '陆忠兵',
        'day': [3],
        'time': [9,10,11], 
        'room': '雁栖湖东区礼堂',
        'week': [11]
    },
]
